0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $flowVelocity;
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "(wheel|contactPatchSide)"
    {
        type            rotatingWallVelocity;
        origin          (0 0.1657 0);
        axis            (0 0 1);
        omega           181.79345706666666;
    }
    "(top|side2|side1)"
    {
        type            slip;
    }
    
}

// ************************************************************************* //

