system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (-1.65 0 -0.99)
    (3.3 0 -0.99)
    (3.3 1.65 -0.99)
    (-1.65 1.65 -0.99)
    (-1.65 0 0.99)
    (3.3 0 0.99)
    (3.3 1.65 0.99)
    (-1.65 1.65 0.99)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 17 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type inlet;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type inlet;
        faces
        (
            (1 2 6 5)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    side2
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    side1
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
