system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom        latestTime;

startTime        0;

stopAt           endTime;

endTime          100;

deltaT           1;

writeControl     timeStep;

writeInterval    100;

purgeWrite       1;

writeFormat      ascii;

writePrecision   6;

writeCompression off;

writeAtEnd       true;

timeFormat       general;

timePrecision    6;

runTimeModifiable true;

functions
{
  #include "forceCoeffs"
  #include "yPlus"
  #include "solverInfo"
  #include "graphFunctionObject"
}

// ************************************************************************* //
