system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;
    libs            (forces);
    patches
    (
        contactPatchSide
        wheel
    );
    coefficients
    (
        Cd
        Cl
        CmPitch
    );
    rho             rhoInf;
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;           // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0.1657 0);
    magUInf         30.0;
    Aref            1;          // Setting to 1 for convenience
    lRef            0.33;       // Wheel outer diameter
}




// ************************************************************************* //
