system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh false;
snap            false;
addLayers       true;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    midWakeRefBox
    {
        type searchableBox;
        min     (0.4 0 -0.3);
        max     (2.0 0.5 0.3);
    }
    farfieldRefBox
    {
        type searchableBox;
        min     (1.8 0 -0.4);
        max     (3.5 0.6 0.4);
    }
    nearWakeRefBox
    {
        type searchableBox;
        min     (0.15 0 -0.2);
        max     (0.5 0.4 0.2);
    }
    wheel.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name wheel;
    }
    contactPatchRefinement_comp
    {
        type searchableBox;
        min     (-0.012 0 -0.05458);
        max     (0.012 0.0015 0.05458);
    }
    wheelRefRegion
    {
        type searchableCylinder;
        point1  (0 0.1657 -0.1);
        point2  (0 0.1657 0.1);
        radius  0.2;
    }
    contactPatchGround.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name contactPatchGround;
    }
    contactPatchSide.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name contactPatchSide;
    }
}


// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 1e7;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 2.5e7;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 0;

    // Allow a certain level of imbalance during refining
    // (since balancing is quite expensive)
    // Expressed as fraction of perfect balance (= overall number of cells /
    // nProcs). 0=balance always.
    maxLoadUnbalance 0.5;

    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 2;


    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        {
            file "midWakeRefBox_surface.obj";
            level 0;
        }
        {
            file "refinmentBox3_surface.obj";
            level 0;
        }
        {
            file "nearWakeRefBox_surface.obj";
            level 0;
        }
        {
            file "wheel.obj";
            level 3;
        }
        {
            file "contactPatchRefinement.obj";
            level 0;
        }
        {
            file "wheelRefRegion_surface.obj";
            level 0;
        }
        {
            file "contactPatchGround.obj";
            level 8;
        }
        {
            file "contactPatchSide.obj";
            level 8;
        }
    );


    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        wheel
        {
            // Surface-wise min and max refinement level
            level       (3 5);

            // Optional specification of patch type (default is wall). No
            // constraint types (cyclic, symmetry) etc. are allowed.
            patchInfo
            {
                type wall;
            }
        }
        contactPatchGround
        {
            level       (8 10);
            // patchInfo
            // {
            //     type wall;
            // }
        }
        contactPatchSide
        {
            level       (8 10);
            patchInfo
            {
                type wall;
            }
        }
    }

    // Resolve sharp angles
    resolveFeatureAngle 180;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
        wheelRefRegion
        {
            mode inside;
            levels ((1E15 5));
        }
        contactPatchRefinement_comp
        {
            mode inside;
            levels ((1E15 10));
        }
        nearWakeRefBox
        {
            mode inside;
            levels ((1E15 2));
        }
        midWakeRefBox
        {
            mode inside;
            levels ((1E15 1));
        }
        farfieldRefBox
        {
            mode inside;
            levels ((1E15 1));
        }
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh (1.25988 1.04315 -0.0329457);

    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}


// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 0;

    //- Number of mesh displacement relaxation iterations.
    nSmoothInternal 0;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 3;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 30;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

        //- Detect (geometric only) features by sampling the surface
        //  (default=false).
        implicitFeatureSnap false;

        //- Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 15;

        //- Detect points on multiple surfaces (only for explicitFeatureSnap)
        multiRegionFeatureSnap false;

        //- Angle used to pick up medial axis points
        concaveAngle 45;

        //- Reduce layer growth where ratio thickness to medial
        //  distance is large
        minAreaRatio 0.3;
}


// Settings for the layer addition.
addLayersControls
{
    // Per final patch (so not geometry!) the layer information
    layers
    {
        "(wheel|contactPatchSide)"
        {
            nSurfaceLayers 2;
            // thicknessModel firstAndRelativeFinal;
            // relativeSizes off;
            // firstLayerThickness 2.20e-3;
            // finalLayerThickness 0.5;
            // minThickness 0;
        }
        // contactPatchSide
        // {
        //     nSurfaceLayers 5;
        //     thicknessModel firstAndRelativeFinal;
        //     relativeSizes off;
        //     firstLayerThickness 2.20e-3;
        //     finalLayerThickness 0.5;
        //     minThickness 0;
        // }
    }

    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes false;
    
    thicknessModel firstAndRelativeFinal;
    
    firstLayerThickness 1.10e-3;

    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness 0.5;

    // Expansion factor for layer mesh
    expansionRatio 1;

    // Minimum thickness of cell layer. If for any reason layer
    // thickness is smaller than minThickness do not add layer.
    // Relative to undistorted size of cell outside layer.
    minThickness 0.0001e-3;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 1.7.x! (didn't do anything in 1.7.x)
    nGrow -1;

    // Adds layers over num_of_layers/nOuterIters iterations, rather than in 1 pass
    // Set nGrow to -1 if using this
    nOuterIter 2;

    // Advanced settings
    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 130;

    // At non-patched sides allow mesh to slip if extrusion direction makes
    // angle larger than slipFeatureAngle.
    maxFaceThicknessRatio 0.5;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 10;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 2;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothThickness 15;

    // Smooth layer thickness over surface patches
    minMedialAxisAngle 90;

    // Stop layer growth on highly warped cells
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 1.7.x! 90 degrees corresponds to 130
    // in 1.7.x.
    nSmoothNormals 3;

    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;

    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;

    // Additional layer thickness model
    nRelaxedIter 25; // default 3

    

}


// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{

    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;

    //- Amount to scale back displacement at error points
    errorReduction 0.75;

    maxNonOrtho             65; // Maybe make this higher?
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80; // Maybe make this higher?
    minVol                  1e-13; // Maybe make this even lower?
    minTetQuality           1e-9;
    minVolCollapseRatio     -1;
    minArea                 -1;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.05; // Reduce this?
    minFaceFlatness         -1;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    relaxed
    {
        maxNonOrtho 75;
    }
}


// Advanced

// Write flags
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
