system/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

yPlus
{
    type            yPlus;
    libs            (fieldFunctionObjects);
    writeFields     yes;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
}


// ************************************************************************* //